from time import *
# 导入time模块
# 质数优化
# 优化前 10000 4.394584894180298秒
#       100000 491.8559818267822秒
# 优化一 10000 0.5091140270233154秒
#       100000 41.997756242752075秒
# 优化二 10000 0.061048269271850586秒
#       100000 0.6928699016571045秒


begin = time()
# 100以内的数
i = 2
while i < 100000 :
    # 默认为质数
    flag = True
    # 质数 从 2到i
    j = 2
    # 优化二  把j < i ->  j < i ** 0.5
    while j <= i ** 0.5 :
        # i 可以除以2,3,4..就表示不是质数
        if i % j == 0 :
            flag = False
            # 优化一,添加break
            break
        j += 1
    if flag :
        print('质数:',i)
        pass
    i += 1
end = time()
print(f'耗时:{ end - begin }秒')